docs/benchmark/results/apisix/ramp-up_output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/joey/api-gateway/lumen-gateway/docs/benchmark/k6/ramp-up.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 1m20s max duration (incl. graceful stop):
              * ramp: Up to 500 looping VUs for 50s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 013/500 VUs, 6767 complete and 0 interrupted iterations
ramp   [   2% ] 013/500 VUs  00.9s/50.0s

running (0m01.9s), 017/500 VUs, 14151 complete and 0 interrupted iterations
ramp   [   4% ] 017/500 VUs  01.9s/50.0s

running (0m02.9s), 021/500 VUs, 22525 complete and 0 interrupted iterations
ramp   [   6% ] 021/500 VUs  02.9s/50.0s

running (0m03.9s), 025/500 VUs, 30353 complete and 0 interrupted iterations
ramp   [   8% ] 025/500 VUs  03.9s/50.0s

running (0m04.9s), 029/500 VUs, 41984 complete and 0 interrupted iterations
ramp   [  10% ] 029/500 VUs  04.9s/50.0s

running (0m05.9s), 033/500 VUs, 53485 complete and 0 interrupted iterations
ramp   [  12% ] 033/500 VUs  05.9s/50.0s

running (0m06.9s), 037/500 VUs, 64730 complete and 0 interrupted iterations
ramp   [  14% ] 037/500 VUs  06.9s/50.0s

running (0m07.9s), 041/500 VUs, 76068 complete and 0 interrupted iterations
ramp   [  16% ] 041/500 VUs  07.9s/50.0s

running (0m08.9s), 045/500 VUs, 86651 complete and 0 interrupted iterations
ramp   [  18% ] 045/500 VUs  08.9s/50.0s

running (0m09.9s), 049/500 VUs, 97764 complete and 0 interrupted iterations
ramp   [  20% ] 049/500 VUs  09.9s/50.0s

running (0m10.9s), 054/500 VUs, 110052 complete and 0 interrupted iterations
ramp   [  22% ] 054/500 VUs  10.9s/50.0s

running (0m11.9s), 059/500 VUs, 120518 complete and 0 interrupted iterations
ramp   [  24% ] 059/500 VUs  11.9s/50.0s

running (0m12.9s), 064/500 VUs, 132371 complete and 0 interrupted iterations
ramp   [  26% ] 064/500 VUs  12.9s/50.0s

running (0m13.9s), 069/500 VUs, 145353 complete and 0 interrupted iterations
ramp   [  28% ] 069/500 VUs  13.9s/50.0s

running (0m14.9s), 074/500 VUs, 157849 complete and 0 interrupted iterations
ramp   [  30% ] 074/500 VUs  14.9s/50.0s

running (0m15.9s), 079/500 VUs, 169460 complete and 0 interrupted iterations
ramp   [  32% ] 079/500 VUs  15.9s/50.0s

running (0m16.9s), 084/500 VUs, 179346 complete and 0 interrupted iterations
ramp   [  34% ] 084/500 VUs  16.9s/50.0s

running (0m17.9s), 089/500 VUs, 191416 complete and 0 interrupted iterations
ramp   [  36% ] 089/500 VUs  17.9s/50.0s

running (0m18.9s), 094/500 VUs, 203251 complete and 0 interrupted iterations
ramp   [  38% ] 094/500 VUs  18.9s/50.0s

running (0m19.9s), 099/500 VUs, 217266 complete and 0 interrupted iterations
ramp   [  40% ] 099/500 VUs  19.9s/50.0s

running (0m20.9s), 109/500 VUs, 230066 complete and 0 interrupted iterations
ramp   [  42% ] 109/500 VUs  20.9s/50.0s

running (0m21.9s), 119/500 VUs, 242168 complete and 0 interrupted iterations
ramp   [  44% ] 119/500 VUs  21.9s/50.0s

running (0m22.9s), 129/500 VUs, 254213 complete and 0 interrupted iterations
ramp   [  46% ] 129/500 VUs  22.9s/50.0s

running (0m23.9s), 139/500 VUs, 265838 complete and 0 interrupted iterations
ramp   [  48% ] 139/500 VUs  23.9s/50.0s

running (0m24.9s), 149/500 VUs, 279187 complete and 0 interrupted iterations
ramp   [  50% ] 149/500 VUs  24.9s/50.0s

running (0m25.9s), 159/500 VUs, 291362 complete and 0 interrupted iterations
ramp   [  52% ] 159/500 VUs  25.9s/50.0s

running (0m26.9s), 169/500 VUs, 303799 complete and 0 interrupted iterations
ramp   [  54% ] 169/500 VUs  26.9s/50.0s

running (0m27.9s), 179/500 VUs, 316937 complete and 0 interrupted iterations
ramp   [  56% ] 179/500 VUs  27.9s/50.0s

running (0m28.9s), 189/500 VUs, 330155 complete and 0 interrupted iterations
ramp   [  58% ] 189/500 VUs  28.9s/50.0s

running (0m29.9s), 199/500 VUs, 342004 complete and 0 interrupted iterations
ramp   [  60% ] 199/500 VUs  29.9s/50.0s

running (0m30.9s), 209/500 VUs, 354929 complete and 0 interrupted iterations
ramp   [  62% ] 209/500 VUs  30.9s/50.0s

running (0m31.9s), 219/500 VUs, 367933 complete and 0 interrupted iterations
ramp   [  64% ] 219/500 VUs  31.9s/50.0s

running (0m32.9s), 229/500 VUs, 380318 complete and 0 interrupted iterations
ramp   [  66% ] 229/500 VUs  32.9s/50.0s

running (0m33.9s), 239/500 VUs, 392984 complete and 0 interrupted iterations
ramp   [  68% ] 239/500 VUs  33.9s/50.0s

running (0m34.9s), 249/500 VUs, 406846 complete and 0 interrupted iterations
ramp   [  70% ] 249/500 VUs  34.9s/50.0s

running (0m35.9s), 259/500 VUs, 420325 complete and 0 interrupted iterations
ramp   [  72% ] 259/500 VUs  35.9s/50.0s

running (0m36.9s), 269/500 VUs, 430387 complete and 0 interrupted iterations
ramp   [  74% ] 269/500 VUs  36.9s/50.0s

running (0m37.9s), 279/500 VUs, 442504 complete and 0 interrupted iterations
ramp   [  76% ] 279/500 VUs  37.9s/50.0s

running (0m39.0s), 289/500 VUs, 453080 complete and 0 interrupted iterations
ramp   [  78% ] 289/500 VUs  39.0s/50.0s

running (0m39.9s), 299/500 VUs, 464403 complete and 0 interrupted iterations
ramp   [  80% ] 299/500 VUs  39.9s/50.0s

running (0m40.9s), 318/500 VUs, 475609 complete and 0 interrupted iterations
ramp   [  82% ] 318/500 VUs  40.9s/50.0s

running (0m41.9s), 338/500 VUs, 487955 complete and 0 interrupted iterations
ramp   [  84% ] 338/500 VUs  41.9s/50.0s

running (0m42.9s), 358/500 VUs, 500235 complete and 0 interrupted iterations
ramp   [  86% ] 358/500 VUs  42.9s/50.0s

running (0m43.9s), 378/500 VUs, 512950 complete and 0 interrupted iterations
ramp   [  88% ] 378/500 VUs  43.9s/50.0s

running (0m44.9s), 398/500 VUs, 525314 complete and 0 interrupted iterations
ramp   [  90% ] 398/500 VUs  44.9s/50.0s

running (0m45.9s), 418/500 VUs, 537905 complete and 0 interrupted iterations
ramp   [  92% ] 418/500 VUs  45.9s/50.0s

running (0m46.9s), 438/500 VUs, 549074 complete and 0 interrupted iterations
ramp   [  94% ] 438/500 VUs  46.9s/50.0s

running (0m47.9s), 458/500 VUs, 562880 complete and 0 interrupted iterations
ramp   [  96% ] 458/500 VUs  47.9s/50.0s

running (0m48.9s), 478/500 VUs, 572928 complete and 0 interrupted iterations
ramp   [  98% ] 478/500 VUs  48.9s/50.0s

running (0m49.9s), 498/500 VUs, 583502 complete and 0 interrupted iterations
ramp   [ 100% ] 498/500 VUs  49.9s/50.0s


  █ TOTAL RESULTS 

    checks_total.......: 1168672 23348.554177/s
    checks_succeeded...: 100.00% 1168672 out of 1168672
    checks_failed......: 0.00%   0 out of 1168672

    ✓ status is 200
    ✓ body is not empty

    HTTP
    http_req_duration..............: avg=15.38ms min=304µs    max=197.53ms p(50)=9ms    p(75)=19.45ms p(95)=53.29ms p(99)=83.35ms count=584336
      { expected_response:true }...: avg=15.38ms min=304µs    max=197.53ms p(50)=9ms    p(75)=19.45ms p(95)=53.29ms p(99)=83.35ms count=584336
    http_req_failed................: 0.00%  0 out of 584336
    http_reqs......................: 584336 11674.277089/s

    EXECUTION
    iteration_duration.............: avg=15.46ms min=335.16µs max=197.56ms p(50)=9.07ms p(75)=19.54ms p(95)=53.4ms  p(99)=83.51ms count=584336
    iterations.....................: 584336 11674.277089/s
    vus............................: 498    min=13          max=498
    vus_max........................: 500    min=500         max=500

    NETWORK
    data_received..................: 570 MB 11 MB/s
    data_sent......................: 188 MB 3.8 MB/s



running (0m50.1s), 000/500 VUs, 584336 complete and 0 interrupted iterations
ramp ✓ [ 100% ] 000/500 VUs  50s